import DormInfo from "../../components/DormInfo/DormInfo";
import styles from "../../components/DormInfo/DormInfo.module.css"
import Sidebar from "../../components/Sidebar/Sidebar";
import Header from "../../components/Header/Header";

const DormPage = ({toggleSideBar, isSidebarOpen}) => {
    const specs = [
        {
            "id": 1,
            "address": "г. Москва, проспект Вернадского, дом 86, стр.1 (ближайшая станция метро: Юго-Западная)",
            "living_area": 8359.6,
            "living_capacity": 1161,
            "description": "Общежитие представляет собой 14-этажное панельное здание.\n" +
                "Общежитие блочного типа – раздельные комнаты, расположенные блоками (по 2 комнаты) с отдельным санитарным узлом и душевой комнатой. Кухня на этаже.\n" +
                "Общежитие оборудовано системой видеонаблюдения; пожарной сигнализацией.\n" +
                "В каждой комнате имеется: гардероб (на комнату); кровать (на каждого проживающего); тумбочка (на каждого проживающего); полка (на каждого проживающего); письменный стол (на комнату); стул (на каждого проживающего); розетки 220В; постельные принадлежности (на каждого проживающего): матрас, подушка, одеяло, покрывало, комплект постельного белья.\n" +
                "В общежитии есть комната для самоподготовки, велопарковка, чертежная комната, библиотека, комната занятий танцами, сеть интернет, постирочная комната, теннисный стол."
        },
        {
            "id": 2,
            "address": "г. Москва, Мичуринский проспект, д. 12, корпус 2 (ближайшая ст. метро: Ломоносовский проспект)",
            "living_area": 2374.3,
            "living_capacity": 320,
            "description": "Общежитие представляет собой 5-этажное здание смешанного типа.\n" +
                "Общежитие смешанного типа – раздельные комнаты, расположенные квартирами с отдельным санузлом, душевой и кухней на 1 этаже.\n" +
                "Общежитие оборудовано системой видеонаблюдения; пожарной сигнализацией.\n" +
                "В каждой комнате имеется: гардероб (на комнату); кровать (на каждого проживающего); тумбочка (на каждого проживающего); письменный стол (на комнату); розетки 220В; постельные принадлежности (на каждого проживающего): матрас, подушка, одеяло, комплект постельного белья.\n" +
                "В общежитии есть камера хранения, постирочная комната, гладильная комната, сеть интернет."
        }
    ]

    return (
        <>
            <Sidebar isOpen={isSidebarOpen} toggleSidebar={toggleSideBar}/>
            <section>
                <Header toggleSidebar={toggleSideBar}/>

                <div className={`container-fluid ${styles.dorms_list}`}>
                    {/*<h1>Общежития</h1>*/}
                    {specs.map((spec) => (
                        <DormInfo key={spec.id} spec={spec}/>
                    ))}
                </div>
            </section>
        </>
    )
}

export default DormPage;
